/* eslint-disable line-comment-position */
import { existsSync, mkdirSync, writeFileSync } from "node:fs";

import { type SelectConfig } from "./typings.js";

class Dsy {
  private config: SelectConfig;
  constructor() {
    this.config = [];
  }

  /**
   *
   * @param {string} id
   * @param {string[]} content
   */
  add(id: string, content: string[]): void {
    const ids = id.split("_").map((item) => Number(item));

    // year
    if (ids.length === 1) {
      content.forEach((item, index) => {
        if (!this.config[index]) this.config[index] = { year: "", items: [] };

        this.config[index].year = item;
      });
    }
    // province
    else if (ids.length === 2) {
      if (!this.config[ids[1]]) this.config[ids[1]] = { year: "", items: [] };

      content.forEach((item, index) => {
        if (!this.config[ids[1]].items[index])
          this.config[ids[1]].items[index] = { province: "", items: [] };

        this.config[ids[1]].items[index].province = item;
      });
    }
    // plan
    else if (ids.length === 3) {
      if (!this.config[ids[1]]) this.config[ids[1]] = { year: "", items: [] };

      if (!this.config[ids[1]].items[ids[2]])
        this.config[ids[1]].items[ids[2]] = { province: "", items: [] };

      content.forEach((item, index) => {
        if (!this.config[ids[1]].items[ids[2]].items[index])
          this.config[ids[1]].items[ids[2]].items[index] = {
            plan: "",
            items: [],
          };

        this.config[ids[1]].items[ids[2]].items[index].plan = item;
      });
    }
    // category
    else if (ids.length === 4) {
      if (!this.config[ids[1]]) this.config[ids[1]] = { year: "", items: [] };

      if (!this.config[ids[1]].items[ids[2]])
        this.config[ids[1]].items[ids[2]] = { province: "", items: [] };

      if (!this.config[ids[1]].items[ids[2]].items[ids[3]])
        this.config[ids[1]].items[ids[2]].items[ids[3]] = {
          plan: "",
          items: [],
        };

      content.forEach((item, index) => {
        if (!this.config[ids[1]].items[ids[2]].items[ids[3]].items[index])
          this.config[ids[1]].items[ids[2]].items[ids[3]].items[index] = {
            category: "",
            items: [],
          };

        this.config[ids[1]].items[ids[2]].items[ids[3]].items[index].category =
          item;
      });
    }
    // class
    else if (ids.length === 5) {
      if (!this.config[ids[1]]) this.config[ids[1]] = { year: "", items: [] };

      if (!this.config[ids[1]].items[ids[2]])
        this.config[ids[1]].items[ids[2]] = { province: "", items: [] };

      if (!this.config[ids[1]].items[ids[2]].items[ids[3]])
        this.config[ids[1]].items[ids[2]].items[ids[3]] = {
          plan: "",
          items: [],
        };

      if (!this.config[ids[1]].items[ids[2]].items[ids[3]].items[ids[4]])
        this.config[ids[1]].items[ids[2]].items[ids[3]].items[ids[4]] = {
          category: "",
          items: [],
        };

      content.forEach((item, index) => {
        if (
          !this.config[ids[1]].items[ids[2]].items[ids[3]].items[ids[4]].items[
            index
          ]
        )
          this.config[ids[1]].items[ids[2]].items[ids[3]].items[ids[4]].items[
            index
          ] = { type: "" };

        this.config[ids[1]].items[ids[2]].items[ids[3]].items[ids[4]].items[
          index
        ].type = item;
      });
    }
  }

  exportJSON(): string {
    return JSON.stringify(this.config);
  }
}

const dsy = new Dsy();

//dsy.add('0',['2018','2017','2016']);
//dsy.add('0',['2020']);
dsy.add("0", ["2023"]);
//dsy.add('0',['2019']);
//dsy.add('0',['2018','2017','2016','2015','2014']);

dsy.add("0_0", [
  "北京",
  "天津",
  "河北",
  "山西",
  "内蒙古",
  "辽宁",
  "吉林",
  "黑龙江",
  "上海",
  "江苏",
  "浙江",
  "安徽",
  "福建",
  "江西",
  "山东",
  "河南",
  "湖北",
  "湖南",
  "广东",
  "广西",
  "海南",
  "重庆",
  "四川",
  "贵州",
  "云南",
  "西藏",
  "陕西",
  "甘肃",
  "青海",
  "宁夏",
  "新疆",
]);
//dsy.add('0_1',['北京','天津','河北','山西','内蒙古','辽宁','吉林','黑龙江','上海','江苏','浙江','安徽','福建','江西','山东','河南','湖北','湖南','广东','广西','海南','重庆','四川','贵州','云南','西藏','陕西','甘肃','青海','宁夏','新疆']);
//dsy.add('0_2',['北京','天津','河北','山西','内蒙古','辽宁','吉林','黑龙江','上海','江苏','浙江','安徽','福建','江西','山东','河南','湖北','湖南','广东','广西','海南','重庆','四川','贵州','云南','西藏','陕西','甘肃','青海','宁夏','新疆']);
//dsy.add('0_3',['北京','天津','河北','山西','内蒙古','辽宁','吉林','黑龙江','上海','江苏','浙江','安徽','福建','江西','山东','河南','湖北','湖南','广东','广西','海南','重庆','四川','贵州','云南','西藏','陕西','甘肃','青海','宁夏','新疆']);
//dsy.add('0_3',['北京','天津','河北','山西','内蒙古','辽宁','吉林','黑龙江','上海','江苏','浙江','安徽','福建','江西','山东','河南','湖北','湖南','广东','广西','海南','重庆','四川','贵州','云南','西藏','陕西','甘肃','青海','宁夏','新疆']);
//dsy.add('0_4',['北京','天津','河北','山西','内蒙古','辽宁','吉林','黑龙江','上海','江苏','浙江','安徽','福建','江西','山东','河南','湖北','湖南','广东','广西','海南','重庆','四川','贵州','云南','西藏','陕西','甘肃','青海','宁夏','新疆']);

dsy.add("0_0_0", ["一般计划"]);
dsy.add("0_0_1", ["一般计划"]);
dsy.add("0_0_2", ["一般计划", "国家专项计划", "高校专项计划", "优师专项计划"]); //河北
dsy.add("0_0_3", ["一般计划", "国家专项计划", "高校专项计划", "优师专项计划"]); //山西
dsy.add("0_0_4", [
  "一般计划",
  "少数民族预科",
  "国家专项计划",
  "高校专项计划",
  "优师专项计划",
]); //内蒙古
dsy.add("0_0_5", ["一般计划", "少数民族预科", "高校专项计划"]); //辽宁
dsy.add("0_0_6", [
  "一般计划",
  "少数民族预科",
  "国家专项计划",
  "高校专项计划",
  "优师专项计划",
]); //吉
dsy.add("0_0_7", [
  "一般计划",
  "少数民族预科",
  "国家专项计划",
  "高校专项计划",
  "优师专项计划",
]); //黑
dsy.add("0_0_8", ["一般计划"]); //上海
dsy.add("0_0_9", ["一般计划"]); //苏
dsy.add("0_0_10", ["一般计划", "高校专项计划"]); //浙
dsy.add("0_0_11", ["一般计划", "国家专项计划", "高校专项计划", "优师专项计划"]); //皖
dsy.add("0_0_12", ["一般计划", "高校专项计划"]); //闽
dsy.add("0_0_13", ["一般计划", "国家专项计划", "高校专项计划", "优师专项计划"]); //赣
dsy.add("0_0_14", ["一般计划", "高校专项计划"]); //山东
dsy.add("0_0_15", ["一般计划", "国家专项计划", "高校专项计划", "优师专项计划"]); //豫
dsy.add("0_0_16", ["一般计划", "国家专项计划", "高校专项计划", "优师专项计划"]); //湖北
dsy.add("0_0_17", ["一般计划", "国家专项计划", "高校专项计划", "优师专项计划"]); //湖南
dsy.add("0_0_18", ["一般计划", "高校专项计划"]); //广东
dsy.add("0_0_19", [
  "一般计划",
  "少数民族预科",
  "国家专项计划",
  "高校专项计划",
  "优师专项计划",
]); //广西
dsy.add("0_0_20", ["一般计划", "国家专项计划", "高校专项计划", "优师专项计划"]); //琼
dsy.add("0_0_21", ["一般计划", "国家专项计划", "高校专项计划", "优师专项计划"]); //重庆
dsy.add("0_0_22", [
  "一般计划",
  "少数民族预科",
  "国家专项计划",
  "高校专项计划",
  "优师专项计划",
]); //四川
dsy.add("0_0_23", [
  "一般计划",
  "少数民族预科",
  "国家专项计划",
  "高校专项计划",
  "优师专项计划",
]); //贵州
dsy.add("0_0_24", [
  "一般计划",
  "少数民族预科",
  "国家专项计划",
  "高校专项计划",
  "优师专项计划",
]); //云南
dsy.add("0_0_25", [
  "一般计划",
  "少数民族预科",
  "国家专项计划",
  "高校专项计划",
  "优师专项计划",
]); //西藏
dsy.add("0_0_26", ["一般计划", "国家专项计划", "高校专项计划", "优师专项计划"]); //陕西
dsy.add("0_0_27", [
  "一般计划",
  "少数民族预科",
  "国家专项计划",
  "高校专项计划",
  "优师专项计划",
]); //甘肃
dsy.add("0_0_28", [
  "一般计划",
  "少数民族预科",
  "国家专项计划",
  "高校专项计划",
  "优师专项计划",
]); //青海
dsy.add("0_0_29", [
  "一般计划",
  "少数民族预科",
  "国家专项计划",
  "高校专项计划",
  "优师专项计划",
]); //宁夏
dsy.add("0_0_30", [
  "一般计划",
  "少数民族预科",
  "国家专项计划",
  "高校专项计划",
  "优师专项计划",
  "南疆单列计划",
]);

dsy.add("0_0_0_0", ["文史理工类"]); //京
dsy.add("0_0_1_0", ["文史理工类", "艺术类"]); //津
dsy.add("0_0_2_0", ["文史理工类", "艺术类", "体育类"]); //河北 一般计划
dsy.add("0_0_2_1", ["文史理工类"]); //河北国家专项
dsy.add("0_0_2_2", ["文史理工类"]); //河北高校
dsy.add("0_0_2_3", ["文史理工类"]); //河北优师

dsy.add("0_0_3_0", ["文史理工类", "艺术类", "体育类"]); //山西
dsy.add("0_0_3_1", ["文史理工类"]);
dsy.add("0_0_3_2", ["文史理工类"]);
dsy.add("0_0_3_3", ["文史理工类"]);

dsy.add("0_0_4_0", ["文史理工类", "艺术类", "体育类"]); //内蒙古
dsy.add("0_0_4_1", ["文史理工类"]);
dsy.add("0_0_4_2", ["文史理工类"]);
dsy.add("0_0_4_3", ["文史理工类"]);
dsy.add("0_0_4_4", ["文史理工类"]);

dsy.add("0_0_5_0", ["文史理工类", "艺术类", "体育类"]); //辽宁
dsy.add("0_0_5_1", ["文史理工类"]);
dsy.add("0_0_5_2", ["文史理工类"]);

dsy.add("0_0_6_0", ["文史理工类", "艺术类", "体育类"]); //吉林
dsy.add("0_0_6_1", ["文史理工类"]);
dsy.add("0_0_6_2", ["文史理工类"]);
dsy.add("0_0_6_3", ["文史理工类"]);
dsy.add("0_0_6_4", ["文史理工类"]);

dsy.add("0_0_7_0", ["文史理工类", "艺术类", "体育类"]); //黑
dsy.add("0_0_7_1", ["文史理工类"]);
dsy.add("0_0_7_2", ["文史理工类"]);
dsy.add("0_0_7_3", ["文史理工类"]);
dsy.add("0_0_7_4", ["文史理工类"]);

dsy.add("0_0_8_0", ["文史理工类"]); //沪

dsy.add("0_0_9_0", ["文史理工类", "艺术类"]); //苏

dsy.add("0_0_10_0", ["文史理工类", "艺术类"]); //浙
dsy.add("0_0_10_1", ["文史理工类"]);

dsy.add("0_0_11_0", ["文史理工类"]); //皖
dsy.add("0_0_11_1", ["文史理工类"]);
dsy.add("0_0_11_2", ["文史理工类"]);
dsy.add("0_0_11_3", ["文史理工类"]);

dsy.add("0_0_12_0", ["文史理工类", "艺术类"]); //闽
dsy.add("0_0_12_1", ["文史理工类"]);

dsy.add("0_0_13_0", ["文史理工类"]); //赣
dsy.add("0_0_13_1", ["文史理工类"]);
dsy.add("0_0_13_2", ["文史理工类"]);
dsy.add("0_0_13_3", ["文史理工类"]);

dsy.add("0_0_14_0", ["文史理工类", "艺术类", "体育类"]); //山东
dsy.add("0_0_14_1", ["文史理工类"]);

dsy.add("0_0_15_0", ["文史理工类", "艺术类", "体育类"]); //河南
dsy.add("0_0_15_1", ["文史理工类"]);
dsy.add("0_0_15_2", ["文史理工类"]);
dsy.add("0_0_15_3", ["文史理工类"]);

dsy.add("0_0_16_0", ["文史理工类", "艺术类", "体育类"]); //湖北
dsy.add("0_0_16_1", ["文史理工类"]);
dsy.add("0_0_16_2", ["文史理工类"]);
dsy.add("0_0_16_3", ["文史理工类"]);

dsy.add("0_0_17_0", ["文史理工类", "艺术类", "体育类"]); //湖南
dsy.add("0_0_17_1", ["文史理工类"]);
dsy.add("0_0_17_2", ["文史理工类"]);
dsy.add("0_0_17_3", ["文史理工类"]);

dsy.add("0_0_18_0", ["文史理工类", "艺术类"]); //广东
dsy.add("0_0_18_1", ["文史理工类"]);

dsy.add("0_0_19_0", ["文史理工类"]); //广西
dsy.add("0_0_19_1", ["文史理工类"]);
dsy.add("0_0_19_2", ["文史理工类"]);
dsy.add("0_0_19_3", ["文史理工类"]);
dsy.add("0_0_19_4", ["文史理工类"]);

dsy.add("0_0_20_0", ["文史理工类", "艺术类"]); //海南
dsy.add("0_0_20_1", ["文史理工类"]);
dsy.add("0_0_20_2", ["文史理工类"]);
dsy.add("0_0_20_3", ["文史理工类"]);

dsy.add("0_0_21_0", ["文史理工类", "艺术类"]); // 重庆
dsy.add("0_0_21_1", ["文史理工类"]);
dsy.add("0_0_21_2", ["文史理工类"]);
dsy.add("0_0_21_3", ["文史理工类"]);

dsy.add("0_0_22_0", ["文史理工类", "艺术类"]); //四川
dsy.add("0_0_22_1", ["文史理工类"]);
dsy.add("0_0_22_2", ["文史理工类"]);
dsy.add("0_0_22_3", ["文史理工类"]);
dsy.add("0_0_22_4", ["文史理工类"]);

dsy.add("0_0_23_0", ["文史理工类"]); //贵州
dsy.add("0_0_23_1", ["文史理工类"]);
dsy.add("0_0_23_2", ["文史理工类"]);
dsy.add("0_0_23_3", ["文史理工类"]);
dsy.add("0_0_23_4", ["文史理工类"]);

dsy.add("0_0_24_0", ["文史理工类"]); //云南
dsy.add("0_0_24_1", ["文史理工类"]);
dsy.add("0_0_24_2", ["文史理工类"]);
dsy.add("0_0_24_3", ["文史理工类"]);
dsy.add("0_0_24_4", ["文史理工类"]);

dsy.add("0_0_25_0", ["文史理工类"]); //西藏
dsy.add("0_0_25_1", ["文史理工类"]);
dsy.add("0_0_25_2", ["文史理工类"]);
dsy.add("0_0_25_3", ["文史理工类"]);
dsy.add("0_0_25_4", ["文史理工类"]);

dsy.add("0_0_26_0", ["文史理工类", "体育类"]); //陕西  //?
dsy.add("0_0_26_1", ["文史理工类"]);
dsy.add("0_0_26_2", ["文史理工类"]);
dsy.add("0_0_26_3", ["文史理工类"]);

dsy.add("0_0_27_0", ["文史理工类"]); //甘肃
dsy.add("0_0_27_1", ["文史理工类"]);
dsy.add("0_0_27_2", ["文史理工类"]);
dsy.add("0_0_27_3", ["文史理工类"]);
dsy.add("0_0_27_4", ["文史理工类"]);

dsy.add("0_0_28_0", ["文史理工类"]); //青海
dsy.add("0_0_28_1", ["文史理工类"]);
dsy.add("0_0_28_2", ["文史理工类"]);
dsy.add("0_0_28_3", ["文史理工类"]);
dsy.add("0_0_28_4", ["文史理工类"]);

dsy.add("0_0_29_0", ["文史理工类"]); //宁夏
dsy.add("0_0_29_1", ["文史理工类"]);
dsy.add("0_0_29_2", ["文史理工类"]);
dsy.add("0_0_29_3", ["文史理工类"]);
dsy.add("0_0_29_4", ["文史理工类"]);

dsy.add("0_0_30_0", ["文史理工类", "体育类"]); //新疆
dsy.add("0_0_30_1", ["文史理工类"]);
dsy.add("0_0_30_2", ["文史理工类"]);
dsy.add("0_0_30_3", ["文史理工类"]);
dsy.add("0_0_30_4", ["文史理工类"]);
dsy.add("0_0_30_5", ["文史理工类"]);

dsy.add("0_0_0_0_0", ["综合改革"]); //北京

dsy.add("0_0_1_0_0", ["综合改革"]); //天津
dsy.add("0_0_1_0_1", ["艺术(不分文理)"]);

dsy.add("0_0_2_0_0", ["历史类", "物理类"]); //河北
dsy.add("0_0_2_0_1", ["艺术(不分科目类)"]);
dsy.add("0_0_2_0_2", ["体育(历史类)"]);
dsy.add("0_0_2_1_0", ["历史类", "物理类"]);
dsy.add("0_0_2_2_0", ["历史类", "物理类"]);
dsy.add("0_0_2_3_0", ["历史类", "物理类"]);

dsy.add("0_0_3_0_0", ["文史", "理工"]); //山西
dsy.add("0_0_3_0_1", ["艺术(不分文理)"]);
dsy.add("0_0_3_0_2", ["体育(文)", "体育(理)"]);
dsy.add("0_0_3_1_0", ["文史", "理工"]);
dsy.add("0_0_3_2_0", ["文史", "理工"]);
dsy.add("0_0_3_3_0", ["文史", "理工"]);

dsy.add("0_0_4_0_0", ["文史", "理工"]); //内蒙古
dsy.add("0_0_4_0_1", ["文史", "理工", "艺术(不分文理)"]);
dsy.add("0_0_4_0_2", ["体育(不分文理)"]);
dsy.add("0_0_4_1_0", ["文史", "理工"]);
dsy.add("0_0_4_2_0", ["文史", "理工"]);
dsy.add("0_0_4_3_0", ["文史", "理工"]);
dsy.add("0_0_4_4_0", ["文史", "理工"]);

dsy.add("0_0_5_0_0", ["历史类", "物理类"]); //辽宁
dsy.add("0_0_5_0_1", ["历史类", "物理类", "艺术(历史类)", "艺术(物理类)"]);
dsy.add("0_0_5_0_2", ["体育(历史类)", "体育(物理类)"]);
dsy.add("0_0_5_1_0", ["历史类", "物理类"]);
dsy.add("0_0_5_2_0", ["历史类", "物理类"]);

dsy.add("0_0_6_0_0", ["文史", "理工"]); //吉林
dsy.add("0_0_6_0_1", ["文史", "理工", "艺术(文)", "艺术(理)"]);
dsy.add("0_0_6_0_2", ["体育(文)", "体育(理)"]);
dsy.add("0_0_6_1_0", ["文史", "理工"]);
dsy.add("0_0_6_2_0", ["理工"]);
dsy.add("0_0_6_3_0", ["文史", "理工"]);
dsy.add("0_0_6_4_0", ["文史", "理工"]);

dsy.add("0_0_7_0_0", ["文史", "理工"]); //黑龙江
dsy.add("0_0_7_0_1", ["文史", "艺术(文)", "艺术(理)"]);
dsy.add("0_0_7_0_2", ["体育(文)", "体育(理)"]);
dsy.add("0_0_7_1_0", ["文史", "理工"]);
dsy.add("0_0_7_2_0", ["文史", "理工"]);
dsy.add("0_0_7_3_0", ["文史", "理工"]);
dsy.add("0_0_7_4_0", ["文史", "理工"]);

dsy.add("0_0_8_0_0", ["综合改革"]); //上海

dsy.add("0_0_9_0_0", ["历史类", "物理类"]); //江苏
dsy.add("0_0_9_0_1", ["艺术(历史类)", "艺术(物理类)"]);

dsy.add("0_0_10_0_0", ["综合改革"]); //浙江
dsy.add("0_0_10_0_1", ["艺术(不分文理)"]);
dsy.add("0_0_10_1_0", ["综合改革"]);

dsy.add("0_0_11_0_0", ["文史", "理工"]); //安徽
dsy.add("0_0_11_1_0", ["文史", "理工"]);
dsy.add("0_0_11_2_0", ["文史", "理工"]);
dsy.add("0_0_11_3_0", ["文史", "理工"]);

dsy.add("0_0_12_0_0", ["历史类", "物理类"]); //福建
dsy.add("0_0_12_0_1", ["艺术(历史类)"]);
dsy.add("0_0_12_1_0", ["历史类", "物理类"]);

dsy.add("0_0_13_0_0", ["文史", "理工"]); //江西
dsy.add("0_0_13_1_0", ["文史", "理工"]);
dsy.add("0_0_13_2_0", ["文史", "理工"]);
dsy.add("0_0_13_3_0", ["理工"]);

dsy.add("0_0_14_0_0", ["综合改革"]); //山东
dsy.add("0_0_14_0_1", ["艺术(不分文理)"]);
dsy.add("0_0_14_0_2", ["体育(不分文理)"]);
dsy.add("0_0_14_1_0", ["综合改革"]);

dsy.add("0_0_15_0_0", ["文史", "理工"]); //河南
dsy.add("0_0_15_0_1", ["艺术(文)", "艺术(理)"]);
dsy.add("0_0_15_0_2", ["体育(文)", "体育(理)"]);
dsy.add("0_0_15_1_0", ["文史", "理工"]);
dsy.add("0_0_15_2_0", ["文史", "理工"]);
dsy.add("0_0_15_3_0", ["文史", "理工"]);

dsy.add("0_0_16_0_0", ["历史类", "物理类"]); //湖北
dsy.add("0_0_16_0_1", ["艺术(不分文理)"]);
dsy.add("0_0_16_0_2", ["体育(不分文理)"]);
dsy.add("0_0_16_1_0", ["历史类", "物理类"]);
dsy.add("0_0_16_2_0", ["历史类", "物理类"]);
dsy.add("0_0_16_3_0", ["历史类", "物理类"]);

dsy.add("0_0_17_0_0", ["历史类", "物理类"]); //湖南
dsy.add("0_0_17_0_1", ["艺术(历史类)"]);
dsy.add("0_0_17_0_2", ["体育(历史类)", "体育(物理类)"]);
dsy.add("0_0_17_1_0", ["历史类", "物理类"]);
dsy.add("0_0_17_2_0", ["历史类", "物理类"]);
dsy.add("0_0_17_3_0", ["历史类", "物理类"]);

dsy.add("0_0_18_0_0", ["历史类", "物理类"]); //广东
dsy.add("0_0_18_0_1", ["艺术(不分科目类)"]);
dsy.add("0_0_18_1_0", ["历史类", "物理类"]);

dsy.add("0_0_19_0_0", ["文史", "理工"]); //广西
dsy.add("0_0_19_1_0", ["文史", "理工"]);
dsy.add("0_0_19_2_0", ["文史", "理工"]);
dsy.add("0_0_19_3_0", ["文史", "理工"]);
dsy.add("0_0_19_4_0", ["文史", "理工"]);

dsy.add("0_0_20_0_0", ["综合改革"]); //海南
dsy.add("0_0_20_0_1", ["艺术(不分文理)"]);
dsy.add("0_0_20_1_0", ["综合改革"]);
dsy.add("0_0_20_2_0", ["综合改革"]);
dsy.add("0_0_20_3_0", ["综合改革"]);

dsy.add("0_0_21_0_0", ["历史类", "物理类"]); //重庆
dsy.add("0_0_21_0_1", ["艺术(不分科目类)"]);
dsy.add("0_0_21_1_0", ["历史类", "物理类"]);
dsy.add("0_0_21_2_0", ["历史类", "物理类"]);
dsy.add("0_0_21_3_0", ["历史类", "物理类"]);

dsy.add("0_0_22_0_0", ["文史", "理工"]); //四川
dsy.add("0_0_22_0_1", ["文史", "理工", "艺术(不分文理)"]);
dsy.add("0_0_22_1_0", ["文史", "理工"]);
dsy.add("0_0_22_2_0", ["文史", "理工"]);
dsy.add("0_0_22_3_0", ["文史", "理工"]);
dsy.add("0_0_22_4_0", ["文史", "理工"]);

dsy.add("0_0_23_0_0", ["文史", "理工"]); //贵州
dsy.add("0_0_23_1_0", ["文史", "理工"]);
dsy.add("0_0_23_2_0", ["文史", "理工"]);
dsy.add("0_0_23_3_0", ["文史", "理工"]);
dsy.add("0_0_23_4_0", ["文史", "理工"]);

dsy.add("0_0_24_0_0", ["文史", "理工"]); //云南
dsy.add("0_0_24_1_0", ["文史", "理工"]);
dsy.add("0_0_24_2_0", ["文史", "理工"]);
dsy.add("0_0_24_3_0", ["文史", "理工"]);
dsy.add("0_0_24_4_0", ["文史", "理工"]);

dsy.add("0_0_25_0_0", ["文史", "理工"]); //西藏
dsy.add("0_0_25_1_0", ["文史", "理工"]);
dsy.add("0_0_25_2_0", ["文史", "理工"]);
dsy.add("0_0_25_3_0", ["文史", "理工"]);
dsy.add("0_0_25_4_0", ["文史", "理工"]);

dsy.add("0_0_26_0_0", ["文史", "理工"]); //陕西
dsy.add("0_0_26_0_1", ["体育(理)"]);
dsy.add("0_0_26_1_0", ["文史", "理工"]);
dsy.add("0_0_26_2_0", ["文史", "理工"]);
dsy.add("0_0_26_3_0", ["文史", "理工"]);

dsy.add("0_0_27_0_0", ["文史", "理工"]); //甘肃
dsy.add("0_0_27_1_0", ["文史", "理工"]);
dsy.add("0_0_27_2_0", ["文史", "理工"]);
dsy.add("0_0_27_3_0", ["文史", "理工"]);
dsy.add("0_0_27_4_0", ["文史", "理工"]);

dsy.add("0_0_28_0_0", ["文史", "理工"]); //青海
dsy.add("0_0_28_1_0", ["文史", "理工"]);
dsy.add("0_0_28_2_0", ["文史", "理工"]);
dsy.add("0_0_28_3_0", ["文史", "理工"]);
dsy.add("0_0_28_4_0", ["文史", "理工"]);

dsy.add("0_0_29_0_0", ["文史", "理工"]); //宁夏
dsy.add("0_0_29_1_0", ["文史", "理工"]);
dsy.add("0_0_29_2_0", ["文史", "理工"]);
dsy.add("0_0_29_3_0", ["文史", "理工"]);
dsy.add("0_0_29_4_0", ["文史", "理工"]);

dsy.add("0_0_30_0_0", ["文史", "理工"]); //新疆
dsy.add("0_0_30_0_1", ["体育(不分文理)"]);
dsy.add("0_0_30_1_0", ["文史", "理工"]);
dsy.add("0_0_30_2_0", ["文史", "理工"]);
dsy.add("0_0_30_3_0", ["文史", "理工"]);
dsy.add("0_0_30_4_0", ["文史"]);
dsy.add("0_0_30_5_0", ["文史", "理工"]);

export const genEnrollPlan = (): void => {
  if (!existsSync("./d/function/enroll/"))
    mkdirSync("./d/function/enroll/", { recursive: true });
  writeFileSync("./d/function/enroll/plan.json", dsy.exportJSON());
};
